Updated to use mermaid diagrams as they integrate with GH better
